In [1]:
# pandas(panal datas)

Seris,Dataframe are the two data types in pandas
It is open source library.
It is third party library.
Pandas simplifies the Exploratory Data Analysis(EDA)

1.Series
2.Dataframes
3.Panel
4.Panel 4-D
             Read all these

## Series:1-D Labelled Array

In [2]:
import pandas as pd

In [3]:
#Creating Series from list
mark_list=[88,50,70,90,30]
ser1=pd.Series(mark_list)#Series is a class in pandas
ser1

0    88
1    50
2    70
3    90
4    30
dtype: int64

In [4]:
ser1.index# To check the labels

RangeIndex(start=0, stop=5, step=1)

In [5]:
ser1.values

array([88, 50, 70, 90, 30])

In [6]:
ser1.shape

(5,)

In [7]:
#Method-1
#To provide manual index label
sub=['eng','maths','hindi','phy','chem']
ser2=pd.Series(mark_list,index=sub)
ser2

eng      88
maths    50
hindi    70
phy      90
chem     30
dtype: int64

In [8]:
#Method-2
ser2=pd.Series(mark_list)
ser2.index=sub
ser2

eng      88
maths    50
hindi    70
phy      90
chem     30
dtype: int64

In [9]:
ser2.index#Access row labels

Index(['eng', 'maths', 'hindi', 'phy', 'chem'], dtype='object')

In [10]:
ser2.values#Access values

array([88, 50, 70, 90, 30])

In [11]:
#Creating Series from Dictionary
marks_dict={'eng':88,'maths':50,'hindi':70,'phy':90,'chem':30}
ser3=pd.Series(marks_dict)
ser3

eng      88
maths    50
hindi    70
phy      90
chem     30
dtype: int64

In [12]:
ser1.ndim,ser2.ndim

(1, 1)

In [13]:
ser1.shape,ser2.shape

((5,), (5,))

In [14]:
ser1.dtype,ser2.dtype

(dtype('int64'), dtype('int64'))

In [15]:
ser3=pd.Series(['Drama','Drama','Action','Comedy','Drama','Comedy'])
ser3

0     Drama
1     Drama
2    Action
3    Comedy
4     Drama
5    Comedy
dtype: object

In [16]:
ser3.unique()

array(['Drama', 'Action', 'Comedy'], dtype=object)

In [17]:
ser3.nunique()

3

In [18]:
ser3.values

array(['Drama', 'Drama', 'Action', 'Comedy', 'Drama', 'Comedy'],
      dtype=object)

In [19]:
ser3.value_counts()#Return counts in descending order

Drama     3
Comedy    2
Action    1
dtype: int64

In [20]:
ser3.value_counts()[0]

3

In [21]:
ser3.value_counts().index[0]

'Drama'

In [22]:
ser1.is_unique,ser2.is_unique# Here is_unique is a property

(True, True)

In [23]:
ser1.max()#Here max() is a function

90

In [24]:
ser1.sum()

328

In [25]:
sum(ser1)

328

In [26]:
ser3.is_unique# It tells about unique series

False

In [27]:
ser3

0     Drama
1     Drama
2    Action
3    Comedy
4     Drama
5    Comedy
dtype: object

In [28]:
ser3.dtype#dtype('O') it means now memory is not allocated by python b,coz it is a 
# unknown data type

dtype('O')

In [29]:
a=10
print(type(a))
print(isinstance(a,int))
print(isinstance(a,object))

<class 'int'>
True
True

In [30]:
ser3.str.upper()

0     DRAMA
1     DRAMA
2    ACTION
3    COMEDY
4     DRAMA
5    COMEDY
dtype: object

In [31]:
ser3.str.len()

0    5
1    5
2    6
3    6
4    5
5    6
dtype: int64

In [32]:
#Creating Series from list
l=[1,2,3,4,5]
series=pd.Series(l)
series.index=['a','b','c','d','e']
series
#Creating Series from the dictionary
dict={'name':'pankaj','address':'Basti','college':'IIMT'}
series1=pd.Series(dict)
series1
#Here object means that memory isn't allocated to that unknown thing
series.ndim
series.shape
series1.ndim
series1.shape
series.index
series1.index
#Now providing mannual index
sub=['a','bb','ccc','dddd','eeeee']
series2=pd.Series(l,index=sub)
series2.unique()
series2.nunique()
series2.values
series.values
series1.values
series.value_counts()
series1.value_counts()#It returns the ascending order info.
series2.value_counts()
series.dtype
series1.dtype#object type
series2.dtype
series.values[:]
series1.value_counts()[0]
# series.value_counts()[0]
series.value_counts().index[0]
series1.value_counts().index[-1]
series2.value_counts().index[:4]
series.is_unique
series1.is_unique
series2.is_unique
series2
series.sum()
series
series1
sum(series)
series1
series2.sum()
sum(series2)
series.max()
series1.max()
series1
max(series)
max(series1)
max(series2)
series1,series2
series1.str.len()
series1.str.upper()
series1.str.lower()
series1.str.replace('^','hello',case=False)
series1.str.contains('p',case=False)

name        True
address    False
college    False
dtype: bool

In [33]:
ser3.str.replace('^','Genre ')#'^' it means start of string in regular expression

0     Drama
1     Drama
2    Action
3    Comedy
4     Drama
5    Comedy
dtype: object

In [34]:
ser3.str.replace('^','Genre ',case=False)#'^' it means start of string in regular expression

0     Genre Drama
1     Genre Drama
2    Genre Action
3    Genre Comedy
4     Genre Drama
5    Genre Comedy
dtype: object

In [35]:
#To find individual object
ser3.str.contains('M')

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [36]:
ser3.str.contains('M',case=False)

0     True
1     True
2    False
3     True
4     True
5     True
dtype: bool

In [37]:
ser3[ser3.str.contains('M',case=False)]

0     Drama
1     Drama
3    Comedy
4     Drama
5    Comedy
dtype: object

## Working with text data in pandas ,go to google

## next class dataframe

## Next saturday and sunday will be off

## 01st,March 2020

In [38]:
series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [39]:
series.value_counts()

5    1
4    1
3    1
2    1
1    1
dtype: int64

In [40]:
series.value_counts()[4]

1

In [41]:
series.value_counts().index[1]

4

In [42]:
series1

name       pankaj
address     Basti
college      IIMT
dtype: object

In [43]:
series1.value_counts()

Basti     1
pankaj    1
IIMT      1
dtype: int64

In [44]:
ser1.memory_usage()#It returns byte of memory including index

168

In [45]:
ser1.memory_usage(index=False)#It only return the bytes of values

40

In [46]:
ser1.size

5

In [47]:
ser1.dtype

dtype('int64')

In [48]:
ser3.dtype

dtype('O')

In [49]:
ser3.memory_usage()#reference memory not actual

176

In [50]:
ser3.memory_usage(deep=True)#actually data took 503 bytes not 176

503

In [51]:
# conda update jupyter

In [52]:
ser1

0    88
1    50
2    70
3    90
4    30
dtype: int64

In [53]:
ser1+5

0    93
1    55
2    75
3    95
4    35
dtype: int64

In [54]:
ser3

0     Drama
1     Drama
2    Action
3    Comedy
4     Drama
5    Comedy
dtype: object

In [55]:
ser3+'hello'

0     Dramahello
1     Dramahello
2    Actionhello
3    Comedyhello
4     Dramahello
5    Comedyhello
dtype: object

In [56]:
ser1>80#condition

0     True
1    False
2    False
3     True
4    False
dtype: bool

In [57]:
ser1[ser1>80]#boolean indexing

0    88
3    90
dtype: int64

## Data Manipulation(to access your desired data)

In [58]:
ser1

0    88
1    50
2    70
3    90
4    30
dtype: int64

In [59]:
ser2['maths']#Access element using manual index

50

In [60]:
ser2[1]#Access element using python index

50

In [61]:
ser3

0     Drama
1     Drama
2    Action
3    Comedy
4     Drama
5    Comedy
dtype: object

In [62]:
ser3.index=range(5,11)#providing numeric lablel
ser3

5      Drama
6      Drama
7     Action
8     Comedy
9      Drama
10    Comedy
dtype: object

In [63]:
ser3[6]#using manual label

'Drama'

## loc[means location] and iloc[index location]

In [64]:
ser3.loc[6]#mannual indexing

'Drama'

In [65]:
ser3.iloc[1]#Python idexing

'Drama'

In [66]:
ser1[ser1>80]

0    88
3    90
dtype: int64

In [67]:
#indexing slicing
ser2[::]

eng      88
maths    50
hindi    70
phy      90
chem     30
dtype: int64

In [68]:
ser2[1:3]

maths    50
hindi    70
dtype: int64

In [69]:
ser2['maths':'phy']#I mannual indexing stop point is included

maths    50
hindi    70
phy      90
dtype: int64

In [70]:
ser2['maths':'phy':2]

maths    50
phy      90
dtype: int64

In [71]:
ser3.loc[5:8]

5     Drama
6     Drama
7    Action
8    Comedy
dtype: object

In [72]:
ser3.iloc[:4]

5     Drama
6     Drama
7    Action
8    Comedy
dtype: object

In [73]:
ser3.iloc[::-1]

10    Comedy
9      Drama
8     Comedy
7     Action
6      Drama
5      Drama
dtype: object

In [74]:
ser3.iloc[-1]

'Comedy'

In [75]:
#Series to list
lists=ser3.tolist()
lists,type(lists)

(['Drama', 'Drama', 'Action', 'Comedy', 'Drama', 'Comedy'], list)

In [76]:
# list to values
arr=ser3.values
print(arr,type(arr),sep='\n')

['Drama' 'Drama' 'Action' 'Comedy' 'Drama' 'Comedy']
<class 'numpy.ndarray'>

## Dataframe

## It's a 2-D labelled data with different datatypes

In [77]:
df=pd.DataFrame(mark_list)
df

    0
0  88
1  50
2  70
3  90
4  30

In [78]:
df.shape

(5, 1)

In [79]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [80]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [81]:
sub=['eng','maths','hindi','phy','chem']
df.index=sub

In [82]:
df

        0
eng    88
maths  50
hindi  70
phy    90
chem   30

In [83]:
df.columns=['1st Sem']
df

       1st Sem
eng         88
maths       50
hindi       70
phy         90
chem        30

In [84]:
#M-1
#Creating DataFrame with list
df2=pd.DataFrame([['py',8000,'Noida'],
                 ['C',4000,'GNoida'],
                 ['IoT',15000,'Noida'],
                 ['ML',9000,'Noida'],
                 ['DS',8000,'GNoida']])
df2

     0      1       2
0   py   8000   Noida
1    C   4000  GNoida
2  IoT  15000   Noida
3   ML   9000   Noida
4   DS   8000  GNoida

In [85]:
df2.shape

(5, 3)

In [86]:
df2.ndim

2

In [87]:
df2.dtypes#Here dtypes is for DataFrame ,for series dtype

0    object
1     int64
2    object
dtype: object

In [88]:
df2.info()#Print a concise summary of a DataFrame.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
0    5 non-null object
1    5 non-null int64
2    5 non-null object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [89]:
df2.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
0    5 non-null object
1    5 non-null int64
2    5 non-null object
dtypes: int64(1), object(2)
memory usage: 783.0 bytes

In [90]:
#M-2
#Creating DataFrame list of dictionary
#DataFrame from dictionary of Python Series

In [91]:
#Creating DataFrame list of dictionary
l=[{1:'pankaj',2:'suresh'}]
df3=pd.DataFrame(l)
df3

        1       2
0  pankaj  suresh

d={1:'pankaj',2:'suresh'}
df4=pd.DataFrame(d)
df4

In [92]:
# mark_list
# df=pd.DataFrame(mark_list)
# df.shape
# df.index
# df.ndim
# df.columns
# df.index=['hindi','english','science','maths','physics']
# df.columns=['first semester']
# df
# list_of_list=[['pankaj','ramesh'],[89,50],['Basti','Basti']]
# df2=pd.DataFrame(list_of_list)
# df2.ndim
# df2.shape
# df2.index
# df.index
# df.columns
# df2.columns
# type(df2)
# df2.dtypes
# df2.info()
# df.info(memory_usage='deep')
l=[{1:'pankaj',2:'suresh'}]
df3=pd.DataFrame(l)
print(df3)

        1       2
0  pankaj  suresh

In [93]:
#Write on csv
df2.to_csv('with_header_index.csv')#To save the DataFrame

In [94]:
pwd

'/home/pankaj/------------------------------------------------------------data science------------------------------------------------------------/pandas'

In [95]:
df2.to_csv('with_header.csv',index=False)

In [96]:
df2.to_csv('with_header_under_score',index=False,sep='_')

In [97]:
df2.to_csv('withoutout_header.csv',index=False,header=False)

In [98]:
data=pd.read_csv('with_header.csv')
data

     0      1       2
0   py   8000   Noida
1    C   4000  GNoida
2  IoT  15000   Noida
3   ML   9000   Noida
4   DS   8000  GNoida

In [99]:
data=pd.read_csv('with_header.csv') 
data

     0      1       2
0   py   8000   Noida
1    C   4000  GNoida
2  IoT  15000   Noida
3   ML   9000   Noida
4   DS   8000  GNoida

In [100]:
data=pd.read_csv('with_header_under_score',delimiter='_') 
data

     0      1       2
0   py   8000   Noida
1    C   4000  GNoida
2  IoT  15000   Noida
3   ML   9000   Noida
4   DS   8000  GNoida

In [101]:
df=pd.read_csv('withoutout_header.csv',header=None)
df

     0      1       2
0   py   8000   Noida
1    C   4000  GNoida
2  IoT  15000   Noida
3   ML   9000   Noida
4   DS   8000  GNoida

In [102]:
data=pd.read_csv('withoutout_header.csv',names=['Course','Fees','Location'])
data

  Course   Fees Location
0     py   8000    Noida
1      C   4000   GNoida
2    IoT  15000    Noida
3     ML   9000    Noida
4     DS   8000   GNoida

In [103]:
#Write to excel
df2.to_excel('with_header.xlsx',index=False)
df2

     0      1       2
0   py   8000   Noida
1    C   4000  GNoida
2  IoT  15000   Noida
3   ML   9000   Noida
4   DS   8000  GNoida

In [104]:
df2.to_excel('with_header_sheet.xlsx',index=False,sheet_name='pankaj')
df2

     0      1       2
0   py   8000   Noida
1    C   4000  GNoida
2  IoT  15000   Noida
3   ML   9000   Noida
4   DS   8000  GNoida

## HOME WORK

## CREATE MULTIPLE SHEETS IN EXCEL

In [105]:
missing=pd.read_excel('with_header_sheet.xlsx',sheet_name='pankaj')

## IO TOOLS FOR PANDAS

In [106]:
missing

     0      1       2
0   py   8000   Noida
1    C   4000  GNoida
2  IoT  15000   Noida
3   ML   9000   Noida
4   DS   8000  GNoida

In [107]:
missing.count()#count for non=NON along column

0    5
1    5
2    5
dtype: int64

In [108]:
missing.count(axis=1)#count for non=NON along rows

0    3
1    3
2    3
3    3
4    3
dtype: int64

In [109]:
missing.isnull()

       0      1      2
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [110]:
missing.isnull().sum()#Count for missing data along column

0    0
1    0
2    0
dtype: int64

In [111]:
missing.isnull().sum(axis=1)#Count for missing data along rows

0    0
1    0
2    0
3    0
4    0
dtype: int64

In [112]:
missing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
0    5 non-null object
1    5 non-null int64
2    5 non-null object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [113]:
missing.describe()

                  1
count      5.000000
mean    8800.000000
std     3962.322551
min     4000.000000
25%     8000.000000
50%     8000.000000
75%     9000.000000
max    15000.000000

## HOME WORK

## READ STANDARD DEVIATION

## 14th,March 2020

In [114]:
data

  Course   Fees Location
0     py   8000    Noida
1      C   4000   GNoida
2    IoT  15000    Noida
3     ML   9000    Noida
4     DS   8000   GNoida

In [115]:
data['Course']

0     py
1      C
2    IoT
3     ML
4     DS
Name: Course, dtype: object

In [116]:
type(data['Course'])

pandas.core.series.Series

In [117]:
data[['Course']]

  Course
0     py
1      C
2    IoT
3     ML
4     DS

In [118]:
type(data[['Course']])

pandas.core.frame.DataFrame

In [119]:
data[['Course','Location']]

  Course Location
0     py    Noida
1      C   GNoida
2    IoT    Noida
3     ML    Noida
4     DS   GNoida

In [120]:
data.loc[1,['Course','Location']]#it is like Series

Course           C
Location    GNoida
Name: 1, dtype: object

In [121]:
data.loc[[1],['Course','Location']]# It is like DataFrame

  Course Location
1      C   GNoida

In [122]:
data.loc[[1,4],['Course','Location']]

  Course Location
1      C   GNoida
4     DS   GNoida

In [123]:
data.iloc[[1,4],[0,2]]#using iloc

  Course Location
1      C   GNoida
4     DS   GNoida

In [124]:
data.iloc[:,:]#Using slicing ,and it most useful than loc

  Course   Fees Location
0     py   8000    Noida
1      C   4000   GNoida
2    IoT  15000    Noida
3     ML   9000    Noida
4     DS   8000   GNoida

In [125]:
data.iloc[::2,:2]

  Course   Fees
0     py   8000
2    IoT  15000
4     DS   8000

In [126]:
data.iloc[:3,2]#when we pass direct  numeric value then it gives a Series

0     Noida
1    GNoida
2     Noida
Name: Location, dtype: object

In [127]:
data.iloc[:3,2:3]

  Location
0    Noida
1   GNoida
2    Noida

## Boolean Indexing

In [128]:
data.Fees>5000

0     True
1    False
2     True
3     True
4     True
Name: Fees, dtype: bool

In [129]:
data[data.Fees>5000]

  Course   Fees Location
0     py   8000    Noida
2    IoT  15000    Noida
3     ML   9000    Noida
4     DS   8000   GNoida

In [130]:
data

  Course   Fees Location
0     py   8000    Noida
1      C   4000   GNoida
2    IoT  15000    Noida
3     ML   9000    Noida
4     DS   8000   GNoida

In [131]:
data[(data.Fees>500) & (data.Location=='Noida')]

  Course   Fees Location
0     py   8000    Noida
2    IoT  15000    Noida
3     ML   9000    Noida

## Adding New values ,it is same as dictionary in python

In [132]:
data['Trainer']=['Aditya','Shubham','Shahjad','Dheeraj','Pankaj']

In [133]:
data

  Course   Fees Location  Trainer
0     py   8000    Noida   Aditya
1      C   4000   GNoida  Shubham
2    IoT  15000    Noida  Shahjad
3     ML   9000    Noida  Dheeraj
4     DS   8000   GNoida   Pankaj

In [134]:
#Adding at specific place
data.insert(1,'Course_ID',[101,102,103,104,105])

In [135]:
data

  Course  Course_ID   Fees Location  Trainer
0     py        101   8000    Noida   Aditya
1      C        102   4000   GNoida  Shubham
2    IoT        103  15000    Noida  Shahjad
3     ML        104   9000    Noida  Dheeraj
4     DS        105   8000   GNoida   Pankaj

In [136]:
data.loc[5]=['Java',106,8000,'GNoida','Shazad']

In [137]:
data

  Course  Course_ID   Fees Location  Trainer
0     py        101   8000    Noida   Aditya
1      C        102   4000   GNoida  Shubham
2    IoT        103  15000    Noida  Shahjad
3     ML        104   9000    Noida  Dheeraj
4     DS        105   8000   GNoida   Pankaj
5   Java        106   8000   GNoida   Shazad

## Changing column Name

In [138]:
data.rename({'Course_ID':'ID'},axis=1,inplace=True)
data

  Course   ID   Fees Location  Trainer
0     py  101   8000    Noida   Aditya
1      C  102   4000   GNoida  Shubham
2    IoT  103  15000    Noida  Shahjad
3     ML  104   9000    Noida  Dheeraj
4     DS  105   8000   GNoida   Pankaj
5   Java  106   8000   GNoida   Shazad

## Sorting

In [139]:
data.sort_values('Fees',inplace=True,ascending=True)#inplace=True means modification
data                                                # in original data

  Course   ID   Fees Location  Trainer
1      C  102   4000   GNoida  Shubham
0     py  101   8000    Noida   Aditya
4     DS  105   8000   GNoida   Pankaj
5   Java  106   8000   GNoida   Shazad
3     ML  104   9000    Noida  Dheeraj
2    IoT  103  15000    Noida  Shahjad

In [140]:
data.sort_values('Fees',inplace=True,ascending=False)
data

  Course   ID   Fees Location  Trainer
2    IoT  103  15000    Noida  Shahjad
3     ML  104   9000    Noida  Dheeraj
0     py  101   8000    Noida   Aditya
4     DS  105   8000   GNoida   Pankaj
5   Java  106   8000   GNoida   Shazad
1      C  102   4000   GNoida  Shubham

In [141]:
#Resetting the index
data.reset_index(inplace=True)
data

   index Course   ID   Fees Location  Trainer
0      2    IoT  103  15000    Noida  Shahjad
1      3     ML  104   9000    Noida  Dheeraj
2      0     py  101   8000    Noida   Aditya
3      4     DS  105   8000   GNoida   Pankaj
4      5   Java  106   8000   GNoida   Shazad
5      1      C  102   4000   GNoida  Shubham

In [142]:
data.reset_index(drop=True,inplace=True)
data

   index Course   ID   Fees Location  Trainer
0      2    IoT  103  15000    Noida  Shahjad
1      3     ML  104   9000    Noida  Dheeraj
2      0     py  101   8000    Noida   Aditya
3      4     DS  105   8000   GNoida   Pankaj
4      5   Java  106   8000   GNoida   Shazad
5      1      C  102   4000   GNoida  Shubham

In [143]:
data.drop('Trainer',axis=1,inplace=True)
data

   index Course   ID   Fees Location
0      2    IoT  103  15000    Noida
1      3     ML  104   9000    Noida
2      0     py  101   8000    Noida
3      4     DS  105   8000   GNoida
4      5   Java  106   8000   GNoida
5      1      C  102   4000   GNoida

## threemuscatier
slumdog

In [144]:
data.drop([5],axis=0,inplace=True)#deleting row
data

   index Course   ID   Fees Location
0      2    IoT  103  15000    Noida
1      3     ML  104   9000    Noida
2      0     py  101   8000    Noida
3      4     DS  105   8000   GNoida
4      5   Java  106   8000   GNoida

In [145]:
temp=data.pop('ID')
temp

0    103
1    104
2    101
3    105
4    106
Name: ID, dtype: int64

In [146]:
data

   index Course   Fees Location
0      2    IoT  15000    Noida
1      3     ML   9000    Noida
2      0     py   8000    Noida
3      4     DS   8000   GNoida
4      5   Java   8000   GNoida

## apply() is same as map()

In [147]:
def increment(row):
    if row%2==0 and row%3==0:
        row+=1000
        return row
    elif row%2==0:
        row+=1500
        return row

    else:
        return row
data.Fees=data.Fees.apply(increment)

In [148]:
data

   index Course   Fees Location
0      2    IoT  16000    Noida
1      3     ML  10000    Noida
2      0     py   9500    Noida
3      4     DS   9500   GNoida
4      5   Java   9500   GNoida

## 15th,March 2020

## ML CLASSS 12:00 TO 02:00 ,MONDAY

In [150]:
data=pd.read_excel('/home/pankaj/Downloads/Dataset/City_Weather.xlsx')
data

          Day    City  Temperature  Windspeed     Event
0  2020-01-01   Delhi            5          6      Rain
1  2020-01-02   Delhi            8         12  Moderate
2  2020-01-03   Delhi            7          8      Cold
3  2020-01-04   Delhi           11          5  Moderate
4  2020-01-05   Delhi            5         10      Rain
5  2020-01-01   Kerla           15         12  Moderate
6  2020-01-02   Kerla           17         10       Hot
7  2020-01-03   Kerla           13          9  Moderate
8  2020-01-04   Kerla           16          6  Moderate
9  2020-01-05   Kerla           18         12       Hot
10 2020-01-01  Mumbai           23          6  Moisture
11 2020-01-02  Mumbai           20         12       Hot
12 2020-01-03  Mumbai           18          8  Moderate
13 2020-01-04  Mumbai           20         12      Rain
14 2020-01-05  Mumbai           21         10      Rain

In [151]:
data.shape

(15, 5)

In [152]:
data.columns

Index(['Day', 'City', 'Temperature', 'Windspeed', 'Event'], dtype='object')

In [155]:
data.index

RangeIndex(start=0, stop=15, step=1)

In [156]:
data.head()

         Day   City  Temperature  Windspeed     Event
0 2020-01-01  Delhi            5          6      Rain
1 2020-01-02  Delhi            8         12  Moderate
2 2020-01-03  Delhi            7          8      Cold
3 2020-01-04  Delhi           11          5  Moderate
4 2020-01-05  Delhi            5         10      Rain

In [161]:
data['City'].unique()

array(['Delhi', 'Kerla', 'Mumbai'], dtype=object)

In [162]:
data.City=='Delhi'

0      True
1      True
2      True
3      True
4      True
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
Name: City, dtype: bool

In [164]:
data[data.City=='Delhi']

         Day   City  Temperature  Windspeed     Event
0 2020-01-01  Delhi            5          6      Rain
1 2020-01-02  Delhi            8         12  Moderate
2 2020-01-03  Delhi            7          8      Cold
3 2020-01-04  Delhi           11          5  Moderate
4 2020-01-05  Delhi            5         10      Rain

In [168]:
data[data.City=='Delhi'].Temperature

0     5
1     8
2     7
3    11
4     5
Name: Temperature, dtype: int64

In [169]:
data[data.City=='Delhi'].Temperature.mean()

7.2

In [170]:
data

          Day    City  Temperature  Windspeed     Event
0  2020-01-01   Delhi            5          6      Rain
1  2020-01-02   Delhi            8         12  Moderate
2  2020-01-03   Delhi            7          8      Cold
3  2020-01-04   Delhi           11          5  Moderate
4  2020-01-05   Delhi            5         10      Rain
5  2020-01-01   Kerla           15         12  Moderate
6  2020-01-02   Kerla           17         10       Hot
7  2020-01-03   Kerla           13          9  Moderate
8  2020-01-04   Kerla           16          6  Moderate
9  2020-01-05   Kerla           18         12       Hot
10 2020-01-01  Mumbai           23          6  Moisture
11 2020-01-02  Mumbai           20         12       Hot
12 2020-01-03  Mumbai           18          8  Moderate
13 2020-01-04  Mumbai           20         12      Rain
14 2020-01-05  Mumbai           21         10      Rain

In [172]:
data.City=='Delhi' or data.City=='Kerla' or data.City=='Mumbai'

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [175]:
for i in data.City.unique():
    print(i,'---->',data[data.City==i].Temperature.mean())

Delhi ----> 7.2
Kerla ----> 15.8
Mumbai ----> 20.4

In [177]:
city_gr=data.groupby('City')
city_gr#Its a object of groupby

In [180]:
for city,data in city_gr:
    print(city)
    print('*'*60)
    print(data)

Delhi
************************************************************
         Day   City  Temperature  Windspeed     Event
0 2020-01-01  Delhi            5          6      Rain
1 2020-01-02  Delhi            8         12  Moderate
2 2020-01-03  Delhi            7          8      Cold
3 2020-01-04  Delhi           11          5  Moderate
4 2020-01-05  Delhi            5         10      Rain
Kerla
************************************************************
         Day   City  Temperature  Windspeed     Event
5 2020-01-01  Kerla           15         12  Moderate
6 2020-01-02  Kerla           17         10       Hot
7 2020-01-03  Kerla           13          9  Moderate
8 2020-01-04  Kerla           16          6  Moderate
9 2020-01-05  Kerla           18         12       Hot
Mumbai
************************************************************
          Day    City  Temperature  Windspeed     Event
10 2020-01-01  Mumbai           23          6  Moisture
11 2020-01-02  Mumbai           20         12       Hot
12 2020-01-03  Mumbai           18          8  Moderate
13 2020-01-04  Mumbai           20         12      Rain
14 2020-01-05  Mumbai           21         10      Rain

In [181]:
city_gr.get_group('Delhi')

         Day   City  Temperature  Windspeed     Event
0 2020-01-01  Delhi            5          6      Rain
1 2020-01-02  Delhi            8         12  Moderate
2 2020-01-03  Delhi            7          8      Cold
3 2020-01-04  Delhi           11          5  Moderate
4 2020-01-05  Delhi            5         10      Rain

In [182]:
city_gr.Temperature

In [184]:
city_gr.Temperature.mean()

City
Delhi      7.2
Kerla     15.8
Mumbai    20.4
Name: Temperature, dtype: float64

In [186]:
city_gr.mean()#For numeric values it will give the mean

        Temperature  Windspeed
City
Delhi           7.2        8.2
Kerla          15.8        9.8
Mumbai         20.4        9.6

In [187]:
city_gr.max()

              Day  Temperature  Windspeed     Event
City
Delhi  2020-01-05           11         12      Rain
Kerla  2020-01-05           18         12  Moderate
Mumbai 2020-01-05           23         12      Rain

In [188]:
city_gr.describe()#It gives  the statical values

       Temperature                                               Windspeed  \
             count  mean       std   min   25%   50%   75%   max     count
City
Delhi          5.0   7.2  2.489980   5.0   5.0   7.0   8.0  11.0       5.0
Kerla          5.0  15.8  1.923538  13.0  15.0  16.0  17.0  18.0       5.0
Mumbai         5.0  20.4  1.816590  18.0  20.0  20.0  21.0  23.0       5.0


       mean       std  min  25%   50%   75%   max
City
Delhi   8.2  2.863564  5.0  6.0   8.0  10.0  12.0
Kerla   9.8  2.489980  6.0  9.0  10.0  12.0  12.0
Mumbai  9.6  2.607681  6.0  8.0  10.0  12.0  12.0

## Data Manipulation Technique

In [191]:
df1=pd.read_excel('/home/pankaj/Downloads/Dataset/City_Weather.xlsx','Sheet2')
df1

        City  Max. Temp  Max. WindSpeed
0      Delhi         11              12
1      Kerla         18              12
2     Mumbai         23              12
3        NaN        NaN             NaN
4        NaN        NaN             NaN
5        NaN        NaN             NaN
6       City  Max. Temp  Max. WindSpeed
7   New York          5               8
8  San Diego          8               6
9  Las Vegas          7               5

In [192]:
df1=pd.read_excel('/home/pankaj/Downloads/Dataset/City_Weather.xlsx','Sheet2',nrows=3)
df1

     City  Max. Temp  Max. WindSpeed
0   Delhi         11              12
1   Kerla         18              12
2  Mumbai         23              12

In [204]:
df2=pd.read_excel('/home/pankaj/Downloads/Dataset/City_Weather.xlsx','Sheet2',skiprows=7)
df2

        City  Max. Temp  Max. WindSpeed
0   New York          5               8
1  San Diego          8               6
2  Las Vegas          7               5

## Combines DataFrame

In [205]:
df3=pd.concat([df1,df2],axis=0)
df3

/home/pankaj/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    New York    5    8       City  Max. Temp  Max. WindSpeed
0  San Diego  8.0  6.0        NaN        NaN             NaN
1  Las Vegas  7.0  5.0        NaN        NaN             NaN
0        NaN  NaN  NaN   New York        5.0             8.0
1        NaN  NaN  NaN  San Diego        8.0             6.0
2        NaN  NaN  NaN  Las Vegas        7.0             5.0

In [206]:
df3=pd.concat([df1,df2],axis=0,keys=['India','US'])
df3

/home/pankaj/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          New York    5    8       City  Max. Temp  Max. WindSpeed
India 0  San Diego  8.0  6.0        NaN        NaN             NaN
      1  Las Vegas  7.0  5.0        NaN        NaN             NaN
US    0        NaN  NaN  NaN   New York        5.0             8.0
      1        NaN  NaN  NaN  San Diego        8.0             6.0
      2        NaN  NaN  NaN  Las Vegas        7.0             5.0

In [207]:
df2=pd.read_excel('/home/pankaj/Downloads/Dataset/City_Weather.xlsx','Sheet3')
df2

      City  Max. Temp  Max. WindSpeed
0    Delhi         11              12
1    Kerla         18              12
2   Mumbai         23              12
3      NaN        NaN             NaN
4      NaN        NaN             NaN
5      NaN        NaN             NaN
6     City  Mean Temp  Mean WindSpeed
7   Mumbai       20.4             9.6
8    Kerla       15.8             9.8
9    Delhi        7.8             8.2
10     NaN        NaN             NaN
11     NaN        NaN             NaN
12    City  Mean Temp  Mean WindSpeed
13  Mumbai       20.4             9.6
14   Delhi        7.8             8.2
15      UP       10.2             7.1

In [211]:
df5=pd.read_excel('/home/pankaj/Downloads/Dataset/City_Weather.xlsx','Sheet3',nrows=3)
df5

     City  Max. Temp  Max. WindSpeed
0   Delhi         11              12
1   Kerla         18              12
2  Mumbai         23              12

In [212]:
df6=pd.read_excel('/home/pankaj/Downloads/Dataset/City_Weather.xlsx','Sheet3',nrows=3,
                 skiprows=7)
df6

     City  Mean Temp  Mean WindSpeed
0  Mumbai       20.4             9.6
1   Kerla       15.8             9.8
2   Delhi        7.8             8.2

In [213]:
pd.concat((df5,df6),axis=1)#It has some issue in city data that's why its not relevant

     City  Max. Temp  Max. WindSpeed    City  Mean Temp  Mean WindSpeed
0   Delhi         11              12  Mumbai       20.4             9.6
1   Kerla         18              12   Kerla       15.8             9.8
2  Mumbai         23              12   Delhi        7.8             8.2

In [214]:
pd.merge(df5,df6,on='City')

     City  Max. Temp  Max. WindSpeed  Mean Temp  Mean WindSpeed
0   Delhi         11              12        7.8             8.2
1   Kerla         18              12       15.8             9.8
2  Mumbai         23              12       20.4             9.6

In [220]:
df7=pd.read_excel('/home/pankaj/Downloads/Dataset/City_Weather.xlsx','Sheet3',nrows=3,
                 skiprows=13)
df7

     City  Mean Temp  Mean WindSpeed
0  Mumbai       20.4             9.6
1   Delhi        7.8             8.2
2      UP       10.2             7.1

In [222]:
pd.merge(df5,df7,on='City')#Inner join

     City  Max. Temp  Max. WindSpeed  Mean Temp  Mean WindSpeed
0   Delhi         11              12        7.8             8.2
1  Mumbai         23              12       20.4             9.6

In [223]:
pd.merge(df5,df7,on='City',how='outer')#Outer join

     City  Max. Temp  Max. WindSpeed  Mean Temp  Mean WindSpeed
0   Delhi       11.0            12.0        7.8             8.2
1   Kerla       18.0            12.0        NaN             NaN
2  Mumbai       23.0            12.0       20.4             9.6
3      UP        NaN             NaN       10.2             7.1

In [225]:
pd.merge(df5,df7,on='City',how='left')#Left join

     City  Max. Temp  Max. WindSpeed  Mean Temp  Mean WindSpeed
0   Delhi         11              12        7.8             8.2
1   Kerla         18              12        NaN             NaN
2  Mumbai         23              12       20.4             9.6

In [226]:
pd.merge(df5,df7,on='City',how='left')#Right join

     City  Max. Temp  Max. WindSpeed  Mean Temp  Mean WindSpeed
0   Delhi         11              12        7.8             8.2
1   Kerla         18              12        NaN             NaN
2  Mumbai         23              12       20.4             9.6

In [228]:
pd.merge(df5,df7,on='City',how='right',indicator=True)#Kaun sa data khan se aaya hai

     City  Max. Temp  Max. WindSpeed  Mean Temp  Mean WindSpeed      _merge
0   Delhi       11.0            12.0        7.8             8.2        both
1  Mumbai       23.0            12.0       20.4             9.6        both
2      UP        NaN             NaN       10.2             7.1  right_only

In [231]:
df8=pd.read_excel('/home/pankaj/Downloads/Dataset/City_Weather.xlsx','Sheet4',nrows=4)
df8

     City  Max. Temp  Max. WindSpeed
0   Delhi       11.0            12.0
1   Kerla       18.0            12.0
2  Mumbai       23.0            12.0
3     NaN        NaN             NaN

In [232]:
df9=pd.read_excel('/home/pankaj/Downloads/Dataset/City_Weather.xlsx','Sheet4',nrows=4,
                 skiprows=7)
df9

     City  Max. Temp  Max. WindSpeed
0   Delhi        7.8             8.2
1   Kerla       15.8             9.8
2  Mumbai       20.4             9.6

In [233]:
#Here in df8 and df9 columns are same (merging)<--------------------------
pd.merge(df8,df9,on='City')

     City  Max. Temp_x  Max. WindSpeed_x  Max. Temp_y  Max. WindSpeed_y
0   Delhi         11.0              12.0          7.8               8.2
1   Kerla         18.0              12.0         15.8               9.8
2  Mumbai         23.0              12.0         20.4               9.6

In [234]:
pd.merge(df8,df9,on='City',suffixes=('_Morning','_Evening'))

,City,Max. Temp_Morning,Max. WindSpeed_Morning,Max. Temp_Evening,Max. WindSpeed_Evening
0,Delhi,11.0,12.0,7.8,8.2
1,Kerla,18.0,12.0,15.8,9.8
2,Mumbai,23.0,12.0,20.4,9.6

## Howe Work

In [236]:
#Pivot
#Pivot_table
#Crosstab